# src/tasks.py

ALL_TASKS = [
    # "Ты как сбежал из палаты? 🏥 Когда будешь вместе с кем-то из игроков скажи - Ты тоже слышишь этот тихий писк? 🙉 Убеди его вслушаться",
    # "Нарисуй член в тетрадке любого из участников 🍆 Можешь сделать это скрытно или прямо у него под носом👃",
    # "Обрадуй коллег туберкулезным кашлем 💀 Сделай 7 безастоновочных кашлей 💨",
    # "Подмена в роддоме 🤰 Поменяй двух лего попупайчиков в офисе местами 🦆 (есть у Егора, Дани, мб еще найдешь у кого)",
    # "В команде замена ♻️ Поменяй стул у любого участника 🪑",
    # "Скример 🙀 Поставь игроку скримера на заставку рабочего стола или напечатай и приклей листок со скримером ему на моник ноута 🖼",
    # "Брусника обмен 🍒 Обменяйся любым предметом с любым игроком по его добровольному согласию📤📥",
    # "Жизнь не сахар ☕️ Высыпь 2 пакетика сахара в кружку любого игрока🥄",
    # "Сафари 📸 Сфоткай затылки любых двух игроков🎯",
    # "Чебурнет🔌 Отключи кабель питания ноутбука у игрока так, чтобы он не заметил⚡️",
    # "Джерри пидор 🖱️ Лиши жизни мышь другого игрока, вытащив батарейку пока он в отлучке 🔋",
    # "Алло это прачечная 📞 Позвони игроку на мобильный или в телеге. Скажи, что набрал случайно 📳",
    # "Бля, подкинули 🎁 Забери предмет у игрока и положи его на стол другому игроку 🔄",
    # "Пустое задание",
    "Тестовое задание 1",
    "Тестовое задание 2",
    "Тестовое задание 3",
    "Тестовое задание 4",
    "Тестовое задание 5",
    "Тестовое задание 6",
]

BACKLOG_TASKS = [
    "Музыкальный сомелье 🎵 Посоветуй одному из участников (или в конфе, где есть кто-то из участников) какой нибудь хуевый трек на свой выбор",
    """Народная мудрость 📜 В диалоге с игроком ответь употреби любую поговорку. Накидаю тебе пара вариантов:
Где гроза, там и вёдро
Баба с возу – кобыле легче""",
    "Атака титанов 🤖 Три раза назови одного игрока в разговоре BIM-титан 🗿Если спросит - придумай что нибудь, ты же импостер",
    "ЭТО ВАЖНО ❗️ Сакцентируй внимание игрока или игроков на каком нибудь рандомном предмете в локации🔎Объясни почему было важно его рассмотреть подробнее",
    "Пора украсть чужую личность 👺 Расскажи любому игроку ЕГО ЖЕ историю так, будто это было с тобой😎 Если у него возникнут вопросы - скажи, что с тобой было тоже самое",
    "Всё ясно, автору 0 лет👦 Передразни другого игрока в личном разговоре 🤡",
    "Денежный леприкон ☘️ Расскажи одному или нескольким игрокам, что будет новогодняя премия и рук группы попросил никому не говорить🙊",
    "Прохор Шаляпин 👵 Расскажи одному или нескольким игрокам историю, как не уступил бабушке место в автобусе и она тебя ударила тебя сумкой🤛",
    "Слово не воробей 🔙 Сделай комплимент игроку по поводу его внешнего вида (или его работы), а потом забери комплимент обратно - а, блин, мне показалось, что...()💅",
    "Птичий хейтер 🕊 Расскажи игроку/игрокам, как ты сегодня утром пнул голубя, когда шел на работу👞",
    "Этот как его - Дима Гондон 🎬 Спроси у игрока, смотрел ли он 'Очень странные дела', затем скажи, что второй сезон - самый пиздатый 🌟",
]
